program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.12.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 640, 640]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 640, 640]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<fp32, [16]> model_0_conv_bias = const()[name = tensor<string, []>("model_0_conv_bias"), val = tensor<fp32, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, [16, 3, 3, 3]> model_0_conv_weight = const()[name = tensor<string, []>("model_0_conv_weight"), val = tensor<fp32, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192)))];
            tensor<fp32, [32]> model_1_conv_bias = const()[name = tensor<string, []>("model_1_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp32, [32, 16, 3, 3]> model_1_conv_weight = const()[name = tensor<string, []>("model_1_conv_weight"), val = tensor<fp32, [32, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2176)))];
            tensor<fp32, [32]> model_2_cv1_conv_bias = const()[name = tensor<string, []>("model_2_cv1_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20672)))];
            tensor<fp32, [32, 32, 1, 1]> model_2_cv1_conv_weight = const()[name = tensor<string, []>("model_2_cv1_conv_weight"), val = tensor<fp32, [32, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20864)))];
            tensor<fp32, [16]> model_2_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_2_m_0_cv1_conv_bias"), val = tensor<fp32, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25024)))];
            tensor<fp32, [16, 16, 3, 3]> model_2_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_2_m_0_cv1_conv_weight"), val = tensor<fp32, [16, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25152)))];
            tensor<fp32, [16]> model_2_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_2_m_0_cv2_conv_bias"), val = tensor<fp32, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34432)))];
            tensor<fp32, [16, 16, 3, 3]> model_2_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_2_m_0_cv2_conv_weight"), val = tensor<fp32, [16, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34560)))];
            tensor<fp32, [32]> model_2_cv2_conv_bias = const()[name = tensor<string, []>("model_2_cv2_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43840)))];
            tensor<fp32, [32, 48, 1, 1]> model_2_cv2_conv_weight = const()[name = tensor<string, []>("model_2_cv2_conv_weight"), val = tensor<fp32, [32, 48, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44032)))];
            tensor<fp32, [64]> model_3_conv_bias = const()[name = tensor<string, []>("model_3_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50240)))];
            tensor<fp32, [64, 32, 3, 3]> model_3_conv_weight = const()[name = tensor<string, []>("model_3_conv_weight"), val = tensor<fp32, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50560)))];
            tensor<fp32, [64]> model_4_cv1_conv_bias = const()[name = tensor<string, []>("model_4_cv1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(124352)))];
            tensor<fp32, [64, 64, 1, 1]> model_4_cv1_conv_weight = const()[name = tensor<string, []>("model_4_cv1_conv_weight"), val = tensor<fp32, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(124672)))];
            tensor<fp32, [32]> model_4_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_4_m_0_cv1_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141120)))];
            tensor<fp32, [32, 32, 3, 3]> model_4_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_4_m_0_cv1_conv_weight"), val = tensor<fp32, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141312)))];
            tensor<fp32, [32]> model_4_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_4_m_0_cv2_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178240)))];
            tensor<fp32, [32, 32, 3, 3]> model_4_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_4_m_0_cv2_conv_weight"), val = tensor<fp32, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178432)))];
            tensor<fp32, [32]> model_4_m_1_cv1_conv_bias = const()[name = tensor<string, []>("model_4_m_1_cv1_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(215360)))];
            tensor<fp32, [32, 32, 3, 3]> model_4_m_1_cv1_conv_weight = const()[name = tensor<string, []>("model_4_m_1_cv1_conv_weight"), val = tensor<fp32, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(215552)))];
            tensor<fp32, [32]> model_4_m_1_cv2_conv_bias = const()[name = tensor<string, []>("model_4_m_1_cv2_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(252480)))];
            tensor<fp32, [32, 32, 3, 3]> model_4_m_1_cv2_conv_weight = const()[name = tensor<string, []>("model_4_m_1_cv2_conv_weight"), val = tensor<fp32, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(252672)))];
            tensor<fp32, [64]> model_4_cv2_conv_bias = const()[name = tensor<string, []>("model_4_cv2_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(289600)))];
            tensor<fp32, [64, 128, 1, 1]> model_4_cv2_conv_weight = const()[name = tensor<string, []>("model_4_cv2_conv_weight"), val = tensor<fp32, [64, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(289920)))];
            tensor<fp32, [128]> model_5_conv_bias = const()[name = tensor<string, []>("model_5_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(322752)))];
            tensor<fp32, [128, 64, 3, 3]> model_5_conv_weight = const()[name = tensor<string, []>("model_5_conv_weight"), val = tensor<fp32, [128, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(323328)))];
            tensor<fp32, [128]> model_6_cv1_conv_bias = const()[name = tensor<string, []>("model_6_cv1_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(618304)))];
            tensor<fp32, [128, 128, 1, 1]> model_6_cv1_conv_weight = const()[name = tensor<string, []>("model_6_cv1_conv_weight"), val = tensor<fp32, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(618880)))];
            tensor<fp32, [64]> model_6_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_6_m_0_cv1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(684480)))];
            tensor<fp32, [64, 64, 3, 3]> model_6_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_6_m_0_cv1_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(684800)))];
            tensor<fp32, [64]> model_6_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_6_m_0_cv2_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(832320)))];
            tensor<fp32, [64, 64, 3, 3]> model_6_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_6_m_0_cv2_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(832640)))];
            tensor<fp32, [64]> model_6_m_1_cv1_conv_bias = const()[name = tensor<string, []>("model_6_m_1_cv1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(980160)))];
            tensor<fp32, [64, 64, 3, 3]> model_6_m_1_cv1_conv_weight = const()[name = tensor<string, []>("model_6_m_1_cv1_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(980480)))];
            tensor<fp32, [64]> model_6_m_1_cv2_conv_bias = const()[name = tensor<string, []>("model_6_m_1_cv2_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1128000)))];
            tensor<fp32, [64, 64, 3, 3]> model_6_m_1_cv2_conv_weight = const()[name = tensor<string, []>("model_6_m_1_cv2_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1128320)))];
            tensor<fp32, [128]> model_6_cv2_conv_bias = const()[name = tensor<string, []>("model_6_cv2_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1275840)))];
            tensor<fp32, [128, 256, 1, 1]> model_6_cv2_conv_weight = const()[name = tensor<string, []>("model_6_cv2_conv_weight"), val = tensor<fp32, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1276416)))];
            tensor<fp32, [256]> model_7_conv_bias = const()[name = tensor<string, []>("model_7_conv_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1407552)))];
            tensor<fp32, [256, 128, 3, 3]> model_7_conv_weight = const()[name = tensor<string, []>("model_7_conv_weight"), val = tensor<fp32, [256, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1408640)))];
            tensor<fp32, [256]> model_8_cv1_conv_bias = const()[name = tensor<string, []>("model_8_cv1_conv_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2588352)))];
            tensor<fp32, [256, 256, 1, 1]> model_8_cv1_conv_weight = const()[name = tensor<string, []>("model_8_cv1_conv_weight"), val = tensor<fp32, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2589440)))];
            tensor<fp32, [128]> model_8_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_8_m_0_cv1_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2851648)))];
            tensor<fp32, [128, 128, 3, 3]> model_8_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_8_m_0_cv1_conv_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2852224)))];
            tensor<fp32, [128]> model_8_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_8_m_0_cv2_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3442112)))];
            tensor<fp32, [128, 128, 3, 3]> model_8_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_8_m_0_cv2_conv_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3442688)))];
            tensor<fp32, [256]> model_8_cv2_conv_bias = const()[name = tensor<string, []>("model_8_cv2_conv_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4032576)))];
            tensor<fp32, [256, 384, 1, 1]> model_8_cv2_conv_weight = const()[name = tensor<string, []>("model_8_cv2_conv_weight"), val = tensor<fp32, [256, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4033664)))];
            tensor<fp32, [128]> model_9_cv1_conv_bias = const()[name = tensor<string, []>("model_9_cv1_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4426944)))];
            tensor<fp32, [128, 256, 1, 1]> model_9_cv1_conv_weight = const()[name = tensor<string, []>("model_9_cv1_conv_weight"), val = tensor<fp32, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4427520)))];
            tensor<fp32, [256]> model_9_cv2_conv_bias = const()[name = tensor<string, []>("model_9_cv2_conv_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4558656)))];
            tensor<fp32, [256, 512, 1, 1]> model_9_cv2_conv_weight = const()[name = tensor<string, []>("model_9_cv2_conv_weight"), val = tensor<fp32, [256, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4559744)))];
            tensor<fp32, [128]> model_12_cv1_conv_bias = const()[name = tensor<string, []>("model_12_cv1_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5084096)))];
            tensor<fp32, [128, 384, 1, 1]> model_12_cv1_conv_weight = const()[name = tensor<string, []>("model_12_cv1_conv_weight"), val = tensor<fp32, [128, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5084672)))];
            tensor<fp32, [64]> model_12_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_12_m_0_cv1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5281344)))];
            tensor<fp32, [64, 64, 3, 3]> model_12_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_12_m_0_cv1_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5281664)))];
            tensor<fp32, [64]> model_12_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_12_m_0_cv2_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5429184)))];
            tensor<fp32, [64, 64, 3, 3]> model_12_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_12_m_0_cv2_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5429504)))];
            tensor<fp32, [128]> model_12_cv2_conv_bias = const()[name = tensor<string, []>("model_12_cv2_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5577024)))];
            tensor<fp32, [128, 192, 1, 1]> model_12_cv2_conv_weight = const()[name = tensor<string, []>("model_12_cv2_conv_weight"), val = tensor<fp32, [128, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5577600)))];
            tensor<fp32, [64]> model_15_cv1_conv_bias = const()[name = tensor<string, []>("model_15_cv1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5675968)))];
            tensor<fp32, [64, 192, 1, 1]> model_15_cv1_conv_weight = const()[name = tensor<string, []>("model_15_cv1_conv_weight"), val = tensor<fp32, [64, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5676288)))];
            tensor<fp32, [32]> model_15_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_15_m_0_cv1_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5725504)))];
            tensor<fp32, [32, 32, 3, 3]> model_15_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_15_m_0_cv1_conv_weight"), val = tensor<fp32, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5725696)))];
            tensor<fp32, [32]> model_15_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_15_m_0_cv2_conv_bias"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5762624)))];
            tensor<fp32, [32, 32, 3, 3]> model_15_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_15_m_0_cv2_conv_weight"), val = tensor<fp32, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5762816)))];
            tensor<fp32, [64]> model_15_cv2_conv_bias = const()[name = tensor<string, []>("model_15_cv2_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5799744)))];
            tensor<fp32, [64, 96, 1, 1]> model_15_cv2_conv_weight = const()[name = tensor<string, []>("model_15_cv2_conv_weight"), val = tensor<fp32, [64, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5800064)))];
            tensor<fp32, [64]> model_16_conv_bias = const()[name = tensor<string, []>("model_16_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5824704)))];
            tensor<fp32, [64, 64, 3, 3]> model_16_conv_weight = const()[name = tensor<string, []>("model_16_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5825024)))];
            tensor<fp32, [128]> model_18_cv1_conv_bias = const()[name = tensor<string, []>("model_18_cv1_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5972544)))];
            tensor<fp32, [128, 192, 1, 1]> model_18_cv1_conv_weight = const()[name = tensor<string, []>("model_18_cv1_conv_weight"), val = tensor<fp32, [128, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5973120)))];
            tensor<fp32, [64]> model_18_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_18_m_0_cv1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6071488)))];
            tensor<fp32, [64, 64, 3, 3]> model_18_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_18_m_0_cv1_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6071808)))];
            tensor<fp32, [64]> model_18_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_18_m_0_cv2_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6219328)))];
            tensor<fp32, [64, 64, 3, 3]> model_18_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_18_m_0_cv2_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6219648)))];
            tensor<fp32, [128]> model_18_cv2_conv_bias = const()[name = tensor<string, []>("model_18_cv2_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6367168)))];
            tensor<fp32, [128, 192, 1, 1]> model_18_cv2_conv_weight = const()[name = tensor<string, []>("model_18_cv2_conv_weight"), val = tensor<fp32, [128, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6367744)))];
            tensor<fp32, [128]> model_19_conv_bias = const()[name = tensor<string, []>("model_19_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6466112)))];
            tensor<fp32, [128, 128, 3, 3]> model_19_conv_weight = const()[name = tensor<string, []>("model_19_conv_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6466688)))];
            tensor<fp32, [256]> model_21_cv1_conv_bias = const()[name = tensor<string, []>("model_21_cv1_conv_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7056576)))];
            tensor<fp32, [256, 384, 1, 1]> model_21_cv1_conv_weight = const()[name = tensor<string, []>("model_21_cv1_conv_weight"), val = tensor<fp32, [256, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7057664)))];
            tensor<fp32, [128]> model_21_m_0_cv1_conv_bias = const()[name = tensor<string, []>("model_21_m_0_cv1_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7450944)))];
            tensor<fp32, [128, 128, 3, 3]> model_21_m_0_cv1_conv_weight = const()[name = tensor<string, []>("model_21_m_0_cv1_conv_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7451520)))];
            tensor<fp32, [128]> model_21_m_0_cv2_conv_bias = const()[name = tensor<string, []>("model_21_m_0_cv2_conv_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8041408)))];
            tensor<fp32, [128, 128, 3, 3]> model_21_m_0_cv2_conv_weight = const()[name = tensor<string, []>("model_21_m_0_cv2_conv_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8041984)))];
            tensor<fp32, [256]> model_21_cv2_conv_bias = const()[name = tensor<string, []>("model_21_cv2_conv_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8631872)))];
            tensor<fp32, [256, 384, 1, 1]> model_21_cv2_conv_weight = const()[name = tensor<string, []>("model_21_cv2_conv_weight"), val = tensor<fp32, [256, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8632960)))];
            tensor<fp32, [64]> model_22_cv2_0_0_conv_bias = const()[name = tensor<string, []>("model_22_cv2_0_0_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9026240)))];
            tensor<fp32, [64, 64, 3, 3]> model_22_cv2_0_0_conv_weight = const()[name = tensor<string, []>("model_22_cv2_0_0_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9026560)))];
            tensor<fp32, [64]> model_22_cv2_0_1_conv_bias = const()[name = tensor<string, []>("model_22_cv2_0_1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9174080)))];
            tensor<fp32, [64, 64, 3, 3]> model_22_cv2_0_1_conv_weight = const()[name = tensor<string, []>("model_22_cv2_0_1_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9174400)))];
            tensor<fp32, [64]> model_22_cv2_0_2_bias = const()[name = tensor<string, []>("model_22_cv2_0_2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9321920)))];
            tensor<fp32, [64, 64, 1, 1]> model_22_cv2_0_2_weight = const()[name = tensor<string, []>("model_22_cv2_0_2_weight"), val = tensor<fp32, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9322240)))];
            tensor<fp32, [64]> model_22_cv2_1_0_conv_bias = const()[name = tensor<string, []>("model_22_cv2_1_0_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9338688)))];
            tensor<fp32, [64, 128, 3, 3]> model_22_cv2_1_0_conv_weight = const()[name = tensor<string, []>("model_22_cv2_1_0_conv_weight"), val = tensor<fp32, [64, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9339008)))];
            tensor<fp32, [64]> model_22_cv2_1_1_conv_bias = const()[name = tensor<string, []>("model_22_cv2_1_1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9633984)))];
            tensor<fp32, [64, 64, 3, 3]> model_22_cv2_1_1_conv_weight = const()[name = tensor<string, []>("model_22_cv2_1_1_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9634304)))];
            tensor<fp32, [64]> model_22_cv2_1_2_bias = const()[name = tensor<string, []>("model_22_cv2_1_2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9781824)))];
            tensor<fp32, [64, 64, 1, 1]> model_22_cv2_1_2_weight = const()[name = tensor<string, []>("model_22_cv2_1_2_weight"), val = tensor<fp32, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9782144)))];
            tensor<fp32, [64]> model_22_cv2_2_0_conv_bias = const()[name = tensor<string, []>("model_22_cv2_2_0_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9798592)))];
            tensor<fp32, [64, 256, 3, 3]> model_22_cv2_2_0_conv_weight = const()[name = tensor<string, []>("model_22_cv2_2_0_conv_weight"), val = tensor<fp32, [64, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9798912)))];
            tensor<fp32, [64]> model_22_cv2_2_1_conv_bias = const()[name = tensor<string, []>("model_22_cv2_2_1_conv_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10388800)))];
            tensor<fp32, [64, 64, 3, 3]> model_22_cv2_2_1_conv_weight = const()[name = tensor<string, []>("model_22_cv2_2_1_conv_weight"), val = tensor<fp32, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10389120)))];
            tensor<fp32, [64]> model_22_cv2_2_2_bias = const()[name = tensor<string, []>("model_22_cv2_2_2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10536640)))];
            tensor<fp32, [64, 64, 1, 1]> model_22_cv2_2_2_weight = const()[name = tensor<string, []>("model_22_cv2_2_2_weight"), val = tensor<fp32, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10536960)))];
            tensor<fp32, [80]> model_22_cv3_0_0_conv_bias = const()[name = tensor<string, []>("model_22_cv3_0_0_conv_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10553408)))];
            tensor<fp32, [80, 64, 3, 3]> model_22_cv3_0_0_conv_weight = const()[name = tensor<string, []>("model_22_cv3_0_0_conv_weight"), val = tensor<fp32, [80, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10553792)))];
            tensor<fp32, [80]> model_22_cv3_0_1_conv_bias = const()[name = tensor<string, []>("model_22_cv3_0_1_conv_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10738176)))];
            tensor<fp32, [80, 80, 3, 3]> model_22_cv3_0_1_conv_weight = const()[name = tensor<string, []>("model_22_cv3_0_1_conv_weight"), val = tensor<fp32, [80, 80, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10738560)))];
            tensor<fp32, [80]> model_22_cv3_0_2_bias = const()[name = tensor<string, []>("model_22_cv3_0_2_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10969024)))];
            tensor<fp32, [80, 80, 1, 1]> model_22_cv3_0_2_weight = const()[name = tensor<string, []>("model_22_cv3_0_2_weight"), val = tensor<fp32, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10969408)))];
            tensor<fp32, [80]> model_22_cv3_1_0_conv_bias = const()[name = tensor<string, []>("model_22_cv3_1_0_conv_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10995072)))];
            tensor<fp32, [80, 128, 3, 3]> model_22_cv3_1_0_conv_weight = const()[name = tensor<string, []>("model_22_cv3_1_0_conv_weight"), val = tensor<fp32, [80, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10995456)))];
            tensor<fp32, [80]> model_22_cv3_1_1_conv_bias = const()[name = tensor<string, []>("model_22_cv3_1_1_conv_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11364160)))];
            tensor<fp32, [80, 80, 3, 3]> model_22_cv3_1_1_conv_weight = const()[name = tensor<string, []>("model_22_cv3_1_1_conv_weight"), val = tensor<fp32, [80, 80, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11364544)))];
            tensor<fp32, [80]> model_22_cv3_1_2_bias = const()[name = tensor<string, []>("model_22_cv3_1_2_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11595008)))];
            tensor<fp32, [80, 80, 1, 1]> model_22_cv3_1_2_weight = const()[name = tensor<string, []>("model_22_cv3_1_2_weight"), val = tensor<fp32, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11595392)))];
            tensor<fp32, [80]> model_22_cv3_2_0_conv_bias = const()[name = tensor<string, []>("model_22_cv3_2_0_conv_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11621056)))];
            tensor<fp32, [80, 256, 3, 3]> model_22_cv3_2_0_conv_weight = const()[name = tensor<string, []>("model_22_cv3_2_0_conv_weight"), val = tensor<fp32, [80, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11621440)))];
            tensor<fp32, [80]> model_22_cv3_2_1_conv_bias = const()[name = tensor<string, []>("model_22_cv3_2_1_conv_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12358784)))];
            tensor<fp32, [80, 80, 3, 3]> model_22_cv3_2_1_conv_weight = const()[name = tensor<string, []>("model_22_cv3_2_1_conv_weight"), val = tensor<fp32, [80, 80, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12359168)))];
            tensor<fp32, [80]> model_22_cv3_2_2_bias = const()[name = tensor<string, []>("model_22_cv3_2_2_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12589632)))];
            tensor<fp32, [80, 80, 1, 1]> model_22_cv3_2_2_weight = const()[name = tensor<string, []>("model_22_cv3_2_2_weight"), val = tensor<fp32, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12590016)))];
            tensor<fp32, [1, 16, 1, 1]> model_22_dfl_conv_weight = const()[name = tensor<string, []>("model_22_dfl_conv_weight"), val = tensor<fp32, [1, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12615680)))];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 16, 320, 320]> input_1 = conv(bias = model_0_conv_bias, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = model_0_conv_weight, x = image__scaled__)[name = tensor<string, []>("input_1")];
            tensor<fp32, [1, 16, 320, 320]> input_3 = silu(x = input_1)[name = tensor<string, []>("input_3")];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 32, 160, 160]> input_5 = conv(bias = model_1_conv_bias, dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = model_1_conv_weight, x = input_3)[name = tensor<string, []>("input_5")];
            tensor<fp32, [1, 32, 160, 160]> input_7 = silu(x = input_5)[name = tensor<string, []>("input_7")];
            tensor<int32, []> var_68 = const()[name = tensor<string, []>("op_68"), val = tensor<int32, []>(1)];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 32, 160, 160]> input_9 = conv(bias = model_2_cv1_conv_bias, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = model_2_cv1_conv_weight, x = input_7)[name = tensor<string, []>("input_9")];
            tensor<fp32, [1, 32, 160, 160]> var_81 = silu(x = input_9)[name = tensor<string, []>("op_81")];
            tensor<int32, [2]> var_82 = const()[name = tensor<string, []>("op_82"), val = tensor<int32, [2]>([16, 16])];
            tensor<int32, []> var_83_axis_0 = const()[name = tensor<string, []>("op_83_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 16, 160, 160]> var_83_0, tensor<fp32, [1, 16, 160, 160]> var_83_1 = split(axis = var_83_axis_0, split_sizes = var_82, x = var_81)[name = tensor<string, []>("op_83")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 16, 160, 160]> input_13 = conv(bias = model_2_m_0_cv1_conv_bias, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = model_2_m_0_cv1_conv_weight, x = var_83_1)[name = tensor<string, []>("input_13")];
            tensor<fp32, [1, 16, 160, 160]> input_15 = silu(x = input_13)[name = tensor<string, []>("input_15")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 16, 160, 160]> input_17 = conv(bias = model_2_m_0_cv2_conv_bias, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = model_2_m_0_cv2_conv_weight, x = input_15)[name = tensor<string, []>("input_17")];
            tensor<fp32, [1, 16, 160, 160]> var_105 = silu(x = input_17)[name = tensor<string, []>("op_105")];
            tensor<fp32, [1, 16, 160, 160]> var_106 = add(x = var_83_1, y = var_105)[name = tensor<string, []>("op_106")];
            tensor<bool, []> input_19_interleave_0 = const()[name = tensor<string, []>("input_19_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, 48, 160, 160]> input_19 = concat(axis = var_68, interleave = input_19_interleave_0, values = (var_83_0, var_83_1, var_106))[name = tensor<string, []>("input_19")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 32, 160, 160]> input_21 = conv(bias = model_2_cv2_conv_bias, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = model_2_cv2_conv_weight, x = input_19)[name = tensor<string, []>("input_21")];
            tensor<fp32, [1, 32, 160, 160]> input_23 = silu(x = input_21)[name = tensor<string, []>("input_23")];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_25_strides_0 = const()[name = tensor<string, []>("input_25_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_25_dilations_0 = const()[name = tensor<string, []>("input_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_25_groups_0 = const()[name = tensor<string, []>("input_25_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, 80, 80]> input_25 = conv(bias = model_3_conv_bias, dilations = input_25_dilations_0, groups = input_25_groups_0, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = input_25_strides_0, weight = model_3_conv_weight, x = input_23)[name = tensor<string, []>("input_25")];
            tensor<fp32, [1, 64, 80, 80]> input_27 = silu(x = input_25)[name = tensor<string, []>("input_27")];
            tensor<int32, []> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<int32, []>(1)];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, 80, 80]> input_29 = conv(bias = model_4_cv1_conv_bias, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = model_4_cv1_conv_weight, x = input_27)[name = tensor<string, []>("input_29")];
            tensor<fp32, [1, 64, 80, 80]> var_151 = silu(x = input_29)[name = tensor<string, []>("op_151")];
            tensor<int32, [2]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_153_axis_0 = const()[name = tensor<string, []>("op_153_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 32, 80, 80]> var_153_0, tensor<fp32, [1, 32, 80, 80]> var_153_1 = split(axis = var_153_axis_0, split_sizes = var_152, x = var_151)[name = tensor<string, []>("op_153")];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_33_strides_0 = const()[name = tensor<string, []>("input_33_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_33_dilations_0 = const()[name = tensor<string, []>("input_33_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_33_groups_0 = const()[name = tensor<string, []>("input_33_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 32, 80, 80]> input_33 = conv(bias = model_4_m_0_cv1_conv_bias, dilations = input_33_dilations_0, groups = input_33_groups_0, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = input_33_strides_0, weight = model_4_m_0_cv1_conv_weight, x = var_153_1)[name = tensor<string, []>("input_33")];
            tensor<fp32, [1, 32, 80, 80]> input_35 = silu(x = input_33)[name = tensor<string, []>("input_35")];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_37_strides_0 = const()[name = tensor<string, []>("input_37_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_37_dilations_0 = const()[name = tensor<string, []>("input_37_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_37_groups_0 = const()[name = tensor<string, []>("input_37_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 32, 80, 80]> input_37 = conv(bias = model_4_m_0_cv2_conv_bias, dilations = input_37_dilations_0, groups = input_37_groups_0, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = input_37_strides_0, weight = model_4_m_0_cv2_conv_weight, x = input_35)[name = tensor<string, []>("input_37")];
            tensor<fp32, [1, 32, 80, 80]> var_175 = silu(x = input_37)[name = tensor<string, []>("op_175")];
            tensor<fp32, [1, 32, 80, 80]> input_39 = add(x = var_153_1, y = var_175)[name = tensor<string, []>("input_39")];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_41_strides_0 = const()[name = tensor<string, []>("input_41_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_41_dilations_0 = const()[name = tensor<string, []>("input_41_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_41_groups_0 = const()[name = tensor<string, []>("input_41_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 32, 80, 80]> input_41 = conv(bias = model_4_m_1_cv1_conv_bias, dilations = input_41_dilations_0, groups = input_41_groups_0, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = input_41_strides_0, weight = model_4_m_1_cv1_conv_weight, x = input_39)[name = tensor<string, []>("input_41")];
            tensor<fp32, [1, 32, 80, 80]> input_43 = silu(x = input_41)[name = tensor<string, []>("input_43")];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_45_strides_0 = const()[name = tensor<string, []>("input_45_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_45_dilations_0 = const()[name = tensor<string, []>("input_45_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_45_groups_0 = const()[name = tensor<string, []>("input_45_groups_0"), val = tensor<int32, []>(1)];
